{
  "id": "entry_1763885432_72c61e59",
  "title": "The Convergence of Five Moons",
  "content": "# The Convergence of Five Moons\n\n## Content\n\nThe Convergence of Five Moons marks the rarest celestial alignment in the known cosmos—an event that occurs once every 3,847 years when the five guardian moons of Aethermoor simultaneously eclipse the dying star Velanthos. During this brief window, the boundaries between the material realm and the Dreaming Lattice grow impossibly thin, allowing the whispers of forgotten gods to bleed through as visible auroras of silver and violet light. Ancient texts from the Archive of Unspoken Names describe how the First Architects deliberately positioned these moons as cosmic locks, and their alignment serves as both key and warning.\n\nWhen the moons align, the Resonance Spires scattered across every inhabited world begin to hum at frequencies that can be felt in bone and blood. The Hollow Sages of the Wandering Citadel have long prophesied that each Convergence allows one truth to pass from the outer darkness into mortal understanding—knowledge too dangerous to exist outside this liminal moment. Those who witness the full alignment without protective wards report experiencing synaesthetic visions: memories that taste of copper, futures that smell of burnt ozone, and the persistent sensation that something vast and patient has noticed them. The Keepers of the Threshold perform the Rite of Sevenfold Binding during each Convergence, though they refuse to say what exactly they are binding.\n\nThe last Convergence birthed the Crystalline Plague that transformed the western continents into singing glass, while also revealing the location of the Codex Primeval to the scholar-queen Thessara the Undimmed. This duality—catastrophe and revelation intertwined—defines the event's significance to every civilization that tracks the stellar calendars. Already, astronomers in the Obsidian Academies report that the moons have begun their slow dance toward the next alignment, expected within two mortal generations. Factions across the realms now race to prepare: some to exploit the thinning barriers, others to reinforce the ancient wards, and a desperate few to finally complete the Architects' unfinished work and lock the moons forever in their separated orbits.\n\n---\n\n**Potential Connections:**\n- The Wandering Citadel (place) - mobile fortress of the Hollow Sages\n- Archive of Unspoken Names (place) - repository of forbidden celestial knowledge\n- Codex Primeval (object) - artifact revealed during last Convergence\n- The First Architects (concept/characters) - ancient builders who positioned the moons\n- Thessara the Undimmed (character) - scholar-queen who found the Codex\n\n**Tags:** celestial-event, prophecy, cosmic-horror, forbidden-knowledge, cyclical-catastrophe",
  "summary": "Generated by llama3",
  "category": "event",
  "tags": [],
  "relationships": [],
  "attributes": {},
  "metadata": {
    "created_by": "skogix",
    "created_at": "2025-11-23T08:10:32Z",
    "updated_at": "2025-11-23T08:10:32Z",
    "version": "1.0",
    "canonical": true
  },
  "visibility": {
    "public": true,
    "restricted_to": []
  },
  "book_id": "book_1763885364_3a8c4281"
}
